const obj = {
  code: 200,
  message: 'ok',
  data: {
      title: '小河淌水1952',
      author: '法老 / 龚琳娜',
      duration: '04:03',
      pic: './images/1.jpg',
      audio: './audio/xiao.m4a',
      lyric: "[00:00.00] 作词 : 法老\n[00:01.00] 作曲 : 法老\n[00:02.00] 编曲 : AYO PRO（DiESi）\n[00:24.42]1951年秋幕\n[00:25.68]依然还未到时候可以踏上归途\n[00:27.78]将来凯旋之时还望妹能继续教我美术\n[00:31.02]队伍现正大步向北我们身上无戎寒装\n[00:34.08]那天上的大雁却似怕了鬼军不停地扑向南方\n[00:37.65]侦查员说那雪山后满是枪炮和坦克\n[00:40.86]我心中已经有了不下千百次的忐忑\n[00:43.47]记得妹幼之时曾问我参军如此坎坷怎不选择做一看客？\n[00:47.49]男自幼穷苦\n[00:48.54]深知今之和平得来多么不易\n[00:51.00]若非人民军队家里哪有钱可以烧柴煮米\n[00:53.97]在谷底我常常梦见妹在唱歌脸上挂着笑\n[00:57.51]跟月牙似的\n[00:58.77]所以我怕我怕那砸向朝鲜的燃烧弹\n[01:01.74]明天也会撕开家乡的云彩\n[01:03.96]每次想到这我眼泪是怎么止都止不住的流\n[01:07.32]男势必拿我之生命血肉来守护你的歌喉\n[01:10.47]月亮出来亮汪汪亮汪汪\n[01:17.16]啊~\n[01:24.54]月亮出来亮汪汪亮汪汪\n[01:32.22]1952年春幕\n[01:33.15]刚被做完了一通简单的手术\n[01:35.25]归途到来时候或得靠子鸣背我上路了\n[01:38.04]我这大男人今天又架不住地哭了\n[01:40.62]指导员就这样牺牲了\n[01:42.12]在我面前把血染进了风里\n[01:44.22]那一刻冲上山头的队伍比平常百倍拥挤\n[01:47.28]因为指导员的余音依然唱在周围每寸空气里\n[01:50.55]从来就没有什么救世主\n[01:52.29]也不靠神仙皇帝\n[01:53.94]我身上那些弹孔和疼痛刹那间竟也全然忘记\n[01:57.72]男曾是一名糊涂兵\n[01:59.16]断没想过为谁去拼命\n[02:01.05]直到我看到朝鲜人民\n[02:02.43]在悲霖苦难中呻吟\n[02:04.08]而新中国刚正经地诞生出些许和平\n[02:06.84]我不禁明白肩上有着什么担负\n[02:08.91]是的红星的光芒定会照亮整座山谷\n[02:12.09]届时我会戴上那大红花摇下车窗\n[02:14.94]看远处洱海边的月下定有妹在为我歌唱\n[02:32.04]月亮出来亮汪汪亮汪汪\n[02:34.50]啊～\n[02:35.61]月亮出来亮汪汪亮汪汪\n[02:39.66]1952年冬至\n[02:40.65]妹相距一别足有五年\n[02:43.56]你从未对我有所吐怨\n[02:45.27]现如今我大概已无法当面致歉\n[02:47.94]那漫天战机在我头上密密麻麻地轰炸\n[02:51.09]身边同志也只留得三人未有倒下\n[02:53.97]但即便粉身碎骨我也断不会把这阵地给抛下\n[02:57.66]我虽是个坚定的唯物主义者\n[02:59.67]却也渴望来生能与你再相拥一刻\n[03:02.52]若时光可以倒回\n[03:03.93]我想时针走的慢一些\n[03:05.88]在太极山口兴许还能多瞧上你几眼\n[03:08.79]妹那朝鲜的高粱地和家乡一样美\n[03:12.00]金风拂过溪水云朵绕着山就像翡翠\n[03:15.27]我把那红花塞进了信纸给你愿它不会枯萎\n[03:18.84]此生有你无所遗憾\n[03:20.91]祝世界和平再无泪水\n[03:23.16]新中国万岁！\n[03:24.96]月亮出来亮汪汪亮汪汪\n[03:28.89]啊～\n[03:39.60]哥像月亮天上走天上走\n[03:44.79]哥啊哥啊~哥啊啊\n[03:48.53] 母带 : CHRIS GEHRINGER(美)\n[03:52.28] 混音 : 杨秋儒\n[03:56.03] 企划 : 沂谦/雷迪/胖狗/陆洋/小罗/聪明的剑星/御狐/鱼目/充首充/安璐/龙崎/包包/望龙/柟柟/砂与海/余七画/lil pac/李奉先\n[03:59.77] 监制 : 邓思楚\n[04:03.52] 出品公司 : AYO！\n"
      
  }
}

const API = {
  queryLyric() {
      return new Promise(resolve => {
          setTimeout(
              () => {
                  resolve(obj)
              },
              Math.round(Math.random() * (2000 - 500) + 500)
          )
      })
  }
}